{
  "carouselItems": [
    {
      "alt": "BSA Homepage",
      "images": [
        {
          "source": "/img/bsa-homepage.webp"
        },
        {
          "source": "/img/bsa-homepage.png"
        }
      ]
    },
    {
      "alt": "BSA About Us",
      "images": [
        {
          "source": "/img/bsa-aboutus.webp"
        },
        {
          "source": "/img/bsa-aboutus.png"
        }
      ]
    },
    {
      "alt": "BSA Blog",
      "images": [
        {
          "source": "/img/bsa-blog.webp"
        },
        {
          "source": "/img/bsa-blog.png"
        }
      ]
    },
    {
      "alt": "BSA Fire Alarms",
      "images": [
        {
          "source": "/img/bsa-firealarms.webp"
        },
        {
          "source": "/img/bsa-firealarms.png"
        }
      ]
    }
  ],
  "resources": [
    {
      "path": "https://www.bsasecurityandfire.co.uk/",
      "label": "Website"
    },
    {
      "path": "https://themeforest.net/item/trade-modern-classified-ads-wordpress-theme/20353321",
      "label": "Trade theme from ThemeForest"
    }
  ],
  "stack": [
    "php",
    "WordPress",
    "HTML",
    "CSS",
    "Ubuntu",
    "AWS",
    "MySQL"
  ],
  "about": "The BSA Security and Fire website is a WordPress website written in PHP. It was implemented using the Trade theme from ThemeForest and was designed by our external designer. \n\nIt has approximately 20 pages, including a homepage, a contact us page and several product pages.\n\nI was the project lead and developer for this website and was responsible for its complete implementation and delivery.",
  "url": "https://www.bsasecurityandfire.co.uk",
  "title": "BSA Security and Fire",
  "images": [],
  "content": "[BSA Security and Fire](https;//www.bsasecurityandfire.co.uk), formerly known as Broadland Security Alarms, had been a long time customer of Design Solution Ltd (henceforth Dessol). We first built their website more than 10 years ago as a fairly standard PHP website with no framework or CMS (Content Management System). This lack of a CMS meant that whenever a change was required, they had to come to us for an update. What's more, as time went on, the website started to look and feel a little dated.\n\nTo help alleviate this issue, BSA Security and Fire and Dessol came to a decision to reinvigorate the website. This would be to both improve the presentation and performance of the website, whilst also allowing them to update it when necessary. To facilitate this, WordPress was utilised using a pre-purchased theme (Trade). New design specifications were brought to us by our designer, and I was tasked with implementing the new website with WordPress.\n",
  "technical": "* PHP\r\n* WordPress\r\n* HTML5\r\n* CSS3\r\n* Linux (Ubuntu)\n   * Apache\n* AWS (Amazon Web Services)\n   * Route 53\n* MySQL"
}