{
  "images": [
    "/img/bsa-call-systems.jpg"
  ],
  "title": "BSA Security and Fire",
  "content": "[BSA Security and Fire](https;//www.bsasecurityandfire.co.uk), formerly known as Borderland Security Alarms, had been a long time customer of Design Solution Ltd (henceforth Dessol). We first built their website more than 10 years ago as a fairly standard PHP website with no framework or CMS (Content Management System). This lack of a CMS meant that whenever a change was required, they had to come to us for an update. What's more, as time went on, the website started to look and feel a little dated.\n\nTo help alleviate this issue, BSA Security and Fire and Dessol came to a decision to reinvigorate the website. The would be to both improve the presentation and performance of the website, whilst also allowing them to update it when necessary. To facilitate this, WordPress was utilised using a pre-purchased theme (Trade). New design specifications were brought to us by our designer, and I was tasked with implementing the new website with WordPress.\n\nAt this time, my personal PHP WordPress knowledge was (and, to be honest, still is) somewhat limited. While I had used WordPress in the past and had created with it, I had not really delved into WordPress' applications, especially with PHP. Given this was the case and given that the modest timescale for the project, I decided to implement the design and pages in a quicker and more straight-forward fashion.\n\nThere are many ways in which you could approach creating a website in WordPress. From my limited knowledge, I would have imagined that the most common technique would be to create page templates for each kind of page you would implement with a child-theme. For this particular job I was given 2 templates to work with: the home page and inner pages, with the actual website consisting of about 20 pages.\n\nOne of the main advantages of using a page template is its re-usability. Instead of rewriting the same code over and over for each page, you just plop the template you need and use the WordPress editor to modify the inner content. Something common to each page suddenly needs to change? Easy! Just modify the template and you're done.\n\nHowever, I did not do this. There were a number of factors that lead to this:\n\n1. I forgot.\n\nAnd so instead I went down a path that, while not irredeemable nor overly problematic, was not apt. Instead of creating any templates (I created none), I instead used a page editing plugin () that was made available to me through the theme that was chosen. Instead of using the WordPress default editor to edit the actual content with the page template handling everything else, the created page needed to be copied and pasted into every other page, so that they all looked the same."
}